readme.org
* Org Lib
[[https://travis-ci.com/noiseOnTheNet/OrgLib.svg?branch=master]]
This is going to be a library for reading / writing emacs [[https://orgmode.org/][Org]] files

The reason is to provide a fast multi OS way to access and modify
information without using Emacs directly, e.g. as a [[https://github.com/nushell/nushell][NuShell]] plug-in or
a [[https://rocket.rs][Rocket]] data access

It is not meant to be complete but enough powerful to be useful; it is
not competing with the elisp implementation, but is meant to extend
the already great environment

** Disclaimer
This is my first project in Rust so any suggestion is welcome

I personally had great benefit from org-mode, this is just a way to
give back to the community
