readme.md

# Table of Contents

1.  [Org Lib](#org39cceda)
    1.  [Disclaimer](#org4e55a63)


<a id="org39cceda"></a>

# Org Lib

<https://travis-ci.com/noiseOnTheNet/OrgLib.svg?branch=master>
This is going to be a library for reading / writing emacs [Org](https://orgmode.org/) files

The reason is to provide a fast multi OS way to access and modify
information without using Emacs directly, e.g. as a [NuShell](https://github.com/nushell/nushell) plug-in or
a [Rocket](https://rocket.rs) data access

It is not meant to be complete but enough powerful to be useful; it is
not competing with the elisp implementation, but is meant to extend
the already great environment


<a id="org4e55a63"></a>

## Disclaimer

This is my first project in Rust so any suggestion is welcome

I personally had great benefit from org-mode, this is just a way to
give back to the community

